use fall23_datn_sd05;

-- dòng sản phẩm
INSERT INTO dong_san_pham (ma, ngay_sua, ngay_tao, ten, trang_thai)
VALUES
('DSP001', '2023-12-08', '2023-10-26', 'Giày chạy bộ', 0),
('DSP002', '2023-12-08', '2023-10-26', 'Giày đá bóng', 0),
('DSP003', '2023-12-08', '2023-10-26', 'Giày leo núi', 0),
('DSP004', '2023-12-08', '2023-10-26', 'Giày đi bộ', 0),
('DSP005', '2023-12-08', '2023-10-26', 'Giày sneaker', 0),
('DSP006', '2023-12-08', '2023-10-26', 'Giày tennis', 0),
('DSP007', '2023-12-08', '2023-10-26', 'Giày tập gym', 0),
('DSP008', '2023-12-08', '2023-10-26', 'Giày cầu lông', 0),
('DSP009', '2023-12-08', '2023-10-26', 'Giày nhảy', 0),
('DSP010', '2023-12-08', '2023-10-26', 'Giày chạy địa hình', 0),
('DSP011', '2023-12-08', '2023-10-26', 'Giày custom', 0),
('DSP012', '2023-12-08', '2023-10-26', 'Giày limited', 0);
select * from dong_san_pham;

-- thương hiệu
INSERT INTO thuong_hieu (ma, ngay_sua, ngay_tao, ten, trang_thai)
VALUES
('TH001','2023-12-08', '2023-10-26', 'Nike', 0),
('TH002','2023-12-08', '2023-10-26', 'Adidas', 0),
('TH003','2023-12-08', '2023-10-26', 'Puma', 0),
('TH004','2023-12-08', '2023-10-26', 'New Balance', 0),
('TH005','2023-12-08', '2023-10-26', 'Converse', 0),
('TH006','2023-12-08', '2023-10-26', 'Skechers', 0),
('TH007','2023-12-08', '2023-10-26', 'Reebok', 0),
('TH008','2023-12-08', '2023-10-26', 'Under Armour', 0),
('TH009','2023-12-08', '2023-10-26', 'ON RUNNING', 0),
('TH010','2023-12-08', '2023-10-26', 'Vans', 0);
select * from thuong_hieu;

-- sản phẩm
INSERT INTO san_pham (anh_chinh, ma, mo_ta, ngay_sua, ngay_tao, ten, trang_thai, id_dong_san_pham, id_thuong_hieu)
VALUES
('Nike Air Force 1.png', 'SP001', 'Thấm hút mồ hôi', '2023-10-26', '2023-10-26', 'Nike Air Force 1', 0, 1, 1),
('Nike Dunk Low.png', 'SP002', 'Thoáng khí', '2023-10-26', '2023-10-26', 'Nike Dunk Low', 0, 2, 1),
('Adidas Ultraboost.png', 'SP003', 'Chống trơn trượt', '2023-10-26', '2023-10-26', 'Adidas Ultraboost', 0, 3, 2),
('Adidas Galaxy.png', 'SP004', 'Thoáng khí', '2023-10-26', '2023-10-26', 'Adidas Galaxy', 0, 4, 2),
('Puma Deviate Nitro 2.png', 'SP005', 'Thoáng khí', '2023-10-26', '2023-10-26', 'Puma Deviate Nitro 2', 0, 5, 3),
('Puma Velocity Nitro.png', 'SP006', 'Thoáng khí', '2023-10-26', '2023-10-26', 'Puma Velocity Nitro', 0, 6, 3),
('New Balance 2002R.png', 'SP007', 'Thoáng khí', '2023-10-26', '2023-10-26', 'New Balance 2002R', 0, 7, 4),
('New Balance Fresh Foam.png', 'SP008', 'Thấm hút mồ hôi', '2023-10-26', '2023-10-26', 'New Balance Fresh Foam', 0, 8, 4),
('Converse Jack Purcell.png', 'SP009', 'Thấm hút mồ hôi', '2023-10-26', '2023-10-26', 'Converse Jack Purcell', 0, 9, 5),
('Converse Cons – One Star.png', 'SP010', 'Thấm hút mồ hôi', '2023-10-26', '2023-10-26', 'Converse Cons – One Star', 0, 10, 5),
('Skechers Bounderc.png', 'SP011', 'Thấm hút mồ hôi', '2023-10-26', '2023-10-26', 'Skechers Bounderc', 0, 11, 6),
('Skechers Ultra Flex 3.0.png', 'SP012', 'Chống trơn trượt', '2023-10-26', '2023-10-26', 'Skechers Ultra Flex 3.0', 0, 12, 6),
('Reebok Nano Flex TR.png', 'SP013', 'Thoáng khí', '2023-10-26', '2023-10-26', 'Reebok Nano Flex TR', 0, 3, 7),
('Reebok Nano X1.png', 'SP014', 'Thấm hút mồ hôi', '2023-10-26', '2023-10-26', 'Reebok Nano X1', 0, 4, 7),
('Under Armour UA HOVR Sonic 4.png', 'SP015', 'Ôm chân', '2023-10-26', '2023-10-26', 'Under Armour UA HOVR Sonic 4', 0, 5, 8),
('Under Armour UA Charged Rogue 2.5.png', 'SP016', 'Trọng lượng nhẹ', '2023-10-26', '2023-10-26', 'Under Armour UA Charged Rogue 2.5', 0, 11, 8),
('ON RUNNING CLOUD 5.png', 'SP017', 'Trọng lượng nhẹ', '2023-10-26', '2023-10-26', 'ON RUNNING CLOUD 5', 0, 12, 9),
('ON RUNNING THE ROGER ADVANTAGE.png', 'SP018', 'Trọng lượng nhẹ', '2023-10-26', '2023-10-26', 'ON RUNNING THE ROGER ADVANTAGE', 0, 8, 9),
('Vans Era Comfycush.png', 'SP019', 'Trọng lượng vừa, đầm chân', '2023-10-26', '2023-10-26', 'Vans Era Comfycush', 0, 11, 10),
('Vans Old Skool Classic.png', 'SP020', 'Trọng lượng vừa', '2023-10-26', '2023-10-26', 'Vans Old Skool Classic', 0, 12, 10);
select * from san_pham;

-- ảnh
INSERT INTO anh (url, id_san_pham)
VALUES
("Nike Air Force 1(2).png", 1),
("Nike Air Force 1(3).png", 1),
("Nike Air Force 1(4).png", 1),

("Nike Dunk Low(2).png", 2),
("Nike Dunk Low(3).png", 2),
("Nike Dunk Low(4).png", 2),

("Adidas Ultraboost(2).png", 3),
("Adidas Ultraboost(3).png", 3),
("Adidas Ultraboost(4).png", 3),

("Adidas Galaxy(2).png", 4),
("Adidas Galaxy(3).png", 4),
("Adidas Galaxy(4).png", 4),

("Puma Deviate Nitro 2(2).png", 5),
("Puma Deviate Nitro 2(3).png", 5),
("Puma Deviate Nitro 2(4).png", 5),

("Puma Velocity Nitro(2).png", 6),
("Puma Velocity Nitro(3).png", 6),
("Puma Velocity Nitro(4).png", 6),

("New Balance 2002R(2).png", 7),
("New Balance 2002R(3).png", 7),
("New Balance 2002R(4).png", 7),

("New Balance Fresh Foam(2).png", 8),
("New Balance Fresh Foam(3).png", 8),
("New Balance Fresh Foam(4).png", 8),

("Converse Jack Purcell(2).png", 9),
("Converse Jack Purcell(3).png", 9),
("Converse Jack Purcell(4).png", 9),

("Converse Cons – One Star(2).png", 10),
("Converse Cons – One Star(3).png", 10),
("Converse Cons – One Star(4).png", 10),

("Skechers Bounderc(2).png", 11),
("Skechers Bounderc(3).png", 11),
("Skechers Bounderc(4).png", 11),

("Skechers Ultra Flex 3.0(2).png", 12),
("Skechers Ultra Flex 3.0(3).png", 12),
("Skechers Ultra Flex 3.0(4).png", 12),

("Reebok Nano Flex TR(2).png", 13),
("Reebok Nano Flex TR(3).png", 13),
("Reebok Nano Flex TR(4).png", 13),

("Reebok Nano X1(2).png", 14),
("Reebok Nano X1(3).png", 14),
("Reebok Nano X1(4).png", 14),

("Under Armour UA HOVR Sonic 4(2).png", 15),
("Under Armour UA HOVR Sonic 4(3).png", 15),
("Under Armour UA HOVR Sonic 4(4).png", 15),

("Under Armour UA Charged Rogue 2.5(2).png", 16),
("Under Armour UA Charged Rogue 2.5(3).png", 16),
("Under Armour UA Charged Rogue 2.5(4).png", 16),

("ON RUNNING CLOUD 5(2).png", 17),
("ON RUNNING CLOUD 5(3).png", 17),
("ON RUNNING CLOUD 5(4).png", 17),

("ON RUNNING THE ROGER ADVANTAGE(2).png", 18),
("ON RUNNING THE ROGER ADVANTAGE(3).png", 18),
("ON RUNNING THE ROGER ADVANTAGE(4).png", 18),

("Vans Era Comfycush(2).png", 19),
("Vans Era Comfycush(3).png", 19),
("Vans Era Comfycush(4).png", 19),

("Vans Old Skool Classic(2).png", 20),
("Vans Old Skool Classic(3).png", 20),
("Vans Old Skool Classic(4).png", 20);
select * from anh;

-- cổ giày
INSERT INTO co_giay (ma, ten)
VALUES
('CG001','Cổ thấp'),
('CG002','Cổ thun thấp'),
('CG003','Cổ lửng'),
('CG004','Cổ thun lửng'),
('CG005','Cổ cao'),
('CG006','Cổ thun cao');
select * from co_giay;

-- đế giày
INSERT INTO de_giay (ma, ten)
VALUES
('DG001','Đế PU'),
('DG002','Đế EVA'),
('DG003','Đế Cao su lưu hóa'),
('DG004','Đế PVC'),
('DG005','Đế Commando'),
('DG006','Đế BPU');
select * from de_giay;

-- lót giày
INSERT INTO lot_giay (ma, ten)
VALUES
('LG001','Lót ngăn mùi'),
('LG002','Lót thể thao'),
('LG003','Lót nửa bàn chân'),
('LG004','Lót thoáng khí'),
('LG005','Lót hỗ trợ vòm'),
('LG006','Lót giảm sốc');
select * from lot_giay;

-- kích thước
INSERT INTO kich_thuoc (ma, ten)
VALUES
('KT001','35'),
('KT002','36'),
('KT003','37'),
('KT004','38'),
('KT005','39'),
('KT006','40'),
('KT007','41'),
('KT008','42'),
('KT009','43'),
('KT0010','44'),
('KT0011','45');
select * from kich_thuoc;

-- màu sắc
INSERT INTO mau_sac (ma, ten)
VALUES
('MS001','Đỏ'),
('MS002','Cam'),
('MS003','Vàng'),
('MS004','Lục'),
('MS005','Lam'),
('MS006','Đen-Trắng'),
('MS007','Đen'),
('MS008','Trắng'),
('MS009','Xám'),
('MS0010','Mix'),
('MS0011','Ngọc trai');
select * from mau_sac;

-- chi tiết sản phẩm
INSERT INTO chi_tiet_san_pham (gia_ban, gia_mac_dinh, ngay_sua, ngay_tao, so_luong_ton, trang_thai, id_co_giay, id_de_giay, id_kich_thuoc, id_lot_giay, id_mau_sac, id_san_pham)
VALUES
(2600000.00, 2600000.00, '2023-10-26', '2023-10-26', 100, 0, 1, 1, 3, 1, 7, 1),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 150, 0, 1, 1, 3, 2, 8, 2),
(3200000.00, 3200000.00, '2023-10-26', '2023-10-26', 200, 0, 1, 1, 3, 3, 4, 3),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 120, 0, 1, 1, 3, 4, 5, 4),
(2650000.00, 2650000.00, '2023-10-26', '2023-10-26', 180, 0, 1, 1, 3, 5, 7, 5),
(3100000.00, 3100000.00, '2023-10-26', '2023-10-26', 190, 0, 1, 1, 3, 6, 7, 6),
(2680000.00, 2680000.00, '2023-10-26', '2023-10-26', 110, 0, 1, 3, 3, 5, 9, 7),
(2800000.00, 2800000.00, '2023-10-26', '2023-10-26', 130, 0, 1, 3, 3, 4, 4, 8),
(2950000.00, 2950000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 3, 3, 3, 7, 9),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 4, 3, 2, 3, 10),
(2950000.00, 2950000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 4, 3, 1, 7, 11),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 4, 3, 6, 7, 12),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 5, 3, 1, 7, 13),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 5, 3, 3, 10, 14),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 5, 3, 5, 4, 15),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 6, 3, 4, 7, 16),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 6, 3, 2, 7, 17),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 6, 3, 6, 11, 18),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 1, 3, 2, 6, 19),
(2800000.00, 2800000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 1, 3, 4, 1, 20),

(2600000.00, 2600000.00, '2023-10-26', '2023-10-26', 100, 0, 1, 1, 7, 1, 7, 1),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 150, 0, 1, 1, 7, 2, 8, 2),
(3200000.00, 3200000.00, '2023-10-26', '2023-10-26', 200, 0, 1, 1, 7, 3, 4, 3),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 120, 0, 1, 1, 7, 4, 5, 4),
(2650000.00, 2650000.00, '2023-10-26', '2023-10-26', 180, 0, 1, 1, 7, 5, 7, 5),
(3100000.00, 3100000.00, '2023-10-26', '2023-10-26', 190, 0, 1, 1, 7, 6, 7, 6),
(2680000.00, 2680000.00, '2023-10-26', '2023-10-26', 110, 0, 1, 3, 7, 5, 9, 7),
(2800000.00, 2800000.00, '2023-10-26', '2023-10-26', 130, 0, 1, 3, 7, 4, 4, 8),
(2950000.00, 2950000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 3, 7, 3, 7, 9),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 4, 7, 2, 3, 10),
(2950000.00, 2950000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 4, 7, 1, 7, 11),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 4, 7, 6, 7, 12),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 5, 7, 1, 7, 13),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 5, 7, 3, 10, 14),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 5, 7, 5, 4, 15),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 6, 7, 4, 7, 16),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 6, 7, 2, 7, 17),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 6, 7, 6, 11, 18),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 1, 7, 2, 6, 19),
(2800000.00, 2800000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 1, 7, 4, 1, 20),

(2600000.00, 2600000.00, '2023-10-26', '2023-10-26', 100, 0, 1, 1, 8, 1, 7, 1),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 150, 0, 1, 1, 8, 2, 8, 2),
(3200000.00, 3200000.00, '2023-10-26', '2023-10-26', 200, 0, 1, 1, 8, 3, 4, 3),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 120, 0, 1, 1, 8, 4, 5, 4),
(2650000.00, 2650000.00, '2023-10-26', '2023-10-26', 180, 0, 1, 1, 8, 5, 7, 5),
(3100000.00, 3100000.00, '2023-10-26', '2023-10-26', 190, 0, 1, 1, 8, 6, 7, 6),
(2680000.00, 2680000.00, '2023-10-26', '2023-10-26', 110, 0, 1, 3, 8, 5, 9, 7),
(2800000.00, 2800000.00, '2023-10-26', '2023-10-26', 130, 0, 1, 3, 8, 4, 4, 8),
(2950000.00, 2950000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 3, 8, 3, 7, 9),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 4, 8, 2, 3, 10),
(2950000.00, 2950000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 4, 8, 1, 7, 11),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 4, 8, 6, 7, 12),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 5, 8, 1, 7, 13),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 5, 8, 3, 10, 14),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 5, 8, 5, 4, 15),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 6, 8, 4, 7, 16),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 6, 8, 2, 7, 17),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 6, 8, 6, 11, 18),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 1, 8, 2, 6, 19),
(2800000.00, 2800000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 1, 8, 4, 1, 20),

(2600000.00, 2600000.00, '2023-10-26', '2023-10-26', 100, 0, 1, 1, 11, 1, 7, 1),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 150, 0, 1, 1, 11, 2, 8, 2),
(3200000.00, 3200000.00, '2023-10-26', '2023-10-26', 200, 0, 1, 1, 11, 3, 4, 3),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 120, 0, 1, 1, 11, 4, 5, 4),
(2650000.00, 2650000.00, '2023-10-26', '2023-10-26', 180, 0, 1, 1, 11, 5, 7, 5),
(3100000.00, 3100000.00, '2023-10-26', '2023-10-26', 190, 0, 1, 1, 11, 6, 7, 6),
(2680000.00, 2680000.00, '2023-10-26', '2023-10-26', 110, 0, 1, 3, 11, 5, 9, 7),
(2800000.00, 2800000.00, '2023-10-26', '2023-10-26', 130, 0, 1, 3, 11, 4, 4, 8),
(2950000.00, 2950000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 3, 11, 3, 7, 9),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 4, 11, 2, 3, 10),
(2950000.00, 2950000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 4, 11, 1, 7, 11),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 4, 11, 6, 7, 12),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 5, 11, 1, 7, 13),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 5, 11, 3, 10, 14),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 5, 11, 5, 4, 15),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 6, 11, 4, 7, 16),
(2700000.00, 2700000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 6, 11, 2, 7, 17),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 6, 11, 6, 11, 18),
(2900000.00, 2900000.00, '2023-10-26', '2023-10-26', 195, 0, 1, 1, 11, 2, 6, 19),
(2800000.00, 2800000.00, '2023-10-26', '2023-10-26', 140, 0, 1, 1, 11, 4, 1, 20);
select * from chi_tiet_san_pham;

-- khách hàng
INSERT INTO khach_hang (email, gioi_tinh, ma, mat_khau, ngay_sua, ngay_tao, sdt, ten, tich_diem, trang_thai)
VALUES
('khachle@gmail.com', 1, 'KH000', '00000000', '2023-10-26', '2023-10-26', '0000000000', 'Khách lẻ', 0, 0),
('hongnt@gmail.com', 1, 'KH001', 'password1', '2023-10-26', '2023-10-26', '098655755', 'Nguyễn Thị Hồng', 0, 0),
('annd@gmail.com', 0, 'KH002', 'password2', '2023-10-26', '2023-10-26', '0987654321', 'Nguyễn Duy Anh', 0, 0),
('nhienla@gmail.com', 1, 'KH003', 'password3', '2023-10-26', '2023-10-26', '0987397153', 'Lê An Nhiên', 0, 0),
('ducpq@gmail.com', 0, 'KH004', 'password4', '2023-10-26', '2023-10-26', '0938587259', 'Phùng Quang Đức', 0, 0),
('linhntm@gmail.com', 1, 'KH005', 'password5', '2023-10-26', '2023-10-26', '0963579603', 'Nguyễn Thị Mai Linh', 0, 0),
('truongtq@gmail.com', 0, 'KH006', 'password6', '2023-10-26', '2023-10-26', '0986155199', 'Trần Quang Trường', 0, 0),
('hanglt@gmail.com', 1, 'KH007', 'password7', '2023-10-26', '2023-10-26', '0988757759', 'Lê Thúy Hằng', 0, 0),
('longnd@gmail.com', 0, 'KH008', 'password8', '2023-10-26', '2023-10-26', '0955432221', 'Đào Duy Long', 0, 0),
('ngant@gmail.com', 1, 'KH009', 'password9', '2023-10-26', '2023-10-26', '0977888811', 'Nghiêm Thi Nguyệt Nga', 0, 0),
('hoanx@gmail.com', 0, 'KH010', 'password10', '2023-10-26', '2023-10-26', '0965452752', 'Nguyễn Xuân Hòa', 0, 0);
select * from khach_hang;

-- địa chỉ
INSERT INTO dia_chi (id, dia_chi, ghi_chu, ngay_sua, ngay_tao, sdt, ten_nguoi_nhan, trang_thai, id_khach_hang)
VALUES
(1,'123 Ba Đình', 'Giao hàng nhanh', '2023-10-26', '2023-10-26', '098655755', 'Nguyễn Thị Hồng', 4, 2),
(2,'456 Quan Nhân, Cầu Giấy', 'Giao hàng tiết kiệm', '2023-10-26', '2023-10-26', '0987654321', 'Nguyễn Duy Anh', 4, 3),
(3,'789 Trần Hưng Đạo', 'Giao hàng nhanh', '2023-10-26', '2023-10-26', '0987397153', 'Lê An Nhiên', 5, 4),
(4,'159 Lê Lợi, Quận 4', 'Giao hàng tiết kiệm', '2023-10-26', '2023-10-26', '0938587259', 'Phùng Quang Đức', 5, 5),
(5,'456 Lê Duẩn, Quận 5', 'Giao hàng giờ hành chính', '2023-10-26', '2023-10-26', '0963579603', 'Nguyễn Thị Mai Linh', 4, 6),
(6,'789 Võ Văn Tân, Quận 6', 'Giao hàng cuối tuần', '2023-10-26', '2023-10-26', '0986155199', 'Trần Quang Trường', 5, 7),
(7,'258 Nguyễn Thị Minh Khai, Đống Đa', 'Giao hàng nhanh', '2023-10-26', '2023-10-26', '0988757759', 'Lê Thúy Hằng', 6, 8),
(8,'369 Bình Phú, Quận 8', 'Giao hàng tiết kiệm', '2023-10-26', '2023-10-26', '0955432221', 'Đào Duy Long', 6, 9),
(9,'147 Phạm Văn Đồng, Quận 9', 'Giao hàng buổi sáng', '2023-10-26', '2023-10-26', '0977888811', 'Nghiêm Thi Nguyệt Nga', 5, 10),
(10,'258 Khuyất Duy Tiến, Cầu Giấy', 'Giao hàng buổi chiều', '2023-10-26', '2023-10-26', '0965452752', 'Nguyễn Xuân Hòa', 4, 11);
select * from dia_chi;

-- giỏ hàng
INSERT INTO gio_hang (ma, ngay_sua, ngay_tao, trang_thai, id_khach_hang)
VALUES
('GH001', '2023-10-26', '2023-10-26', 0, 2),
('GH002', '2023-10-26', '2023-10-26', 0, 3),
('GH003', '2023-10-26', '2023-10-26', 0, 4),
('GH004', '2023-10-26', '2023-10-26', 0, 5),
('GH005', '2023-10-26', '2023-10-26', 0, 6),
('GH006', '2023-10-26', '2023-10-26', 0, 7),
('GH007', '2023-10-26', '2023-10-26', 0, 8),
('GH008', '2023-10-26', '2023-10-26', 0, 9),
('GH009', '2023-10-26', '2023-10-26', 0, 10),
('GH010', '2023-10-26', '2023-10-26', 0, 11);
select * from gio_hang;

-- giỏ hàng chi tiêt
INSERT INTO gio_hang_chi_tiet (don_gia, ngay_sua, ngay_tao, so_luong, trang_thai, id_chi_tiet_san_pham, id_gio_hang)
VALUES
(1000000.00, '2023-10-26', '2023-10-26', 2, 0, 1, 1),
(1200000.00, '2023-10-26', '2023-10-26', 3, 0, 2, 1),
(800000.00, '2023-10-26', '2023-10-26', 1, 0, 3, 2),
(900000.00, '2023-10-26', '2023-10-26', 4, 0, 4, 2),
(1500000.00, '2023-10-26', '2023-10-26', 2, 0, 5, 3),
(1100000.00, '2023-10-26', '2023-10-26', 2, 0, 6, 3),
(1350000.00, '2023-10-26', '2023-10-26', 3, 0, 7, 4),
(1700000.00, '2023-10-26', '2023-10-26', 2, 0, 8, 4),
(1000000.00, '2023-10-26', '2023-10-26', 2, 0, 9, 5),
(1200000.00, '2023-10-26', '2023-10-26', 1, 0, 10, 5);
select * from gio_hang_chi_tiet;

-- khuyến mãi
INSERT INTO khuyen_mai (ma, ten, mo_ta, muc_giam_gia, ngay_bat_dau, ngay_ket_thuc, ngay_sua, ngay_tao, trang_thai)
VALUES
('KM22344324', 'Hè vui', 'Khuyến mại mùa hè', 15, '2023-07-01', '2023-08-31','2023-06-28', '2023-06-28', 1),
('KM22342523', 'Back-to-school','Khuyến mại back-to-school', 10, '2023-09-01', '2023-09-15','2023-08-28', '2023-08-28', 1),
('KM22225543', 'Thứ 6 đen tối','Khuyến mại black friday', 20, '2023-11-25', '2023-11-30','2023-10-26', '2023-10-26', 1),
('KM22344545', 'Giáng sinh an lành','Khuyến mại noenl', 25, '2023-12-01', '2023-12-25','2023-10-26', '2023-10-26', 1),
('KM22414324', 'Năm mới sum vầy','Khuyến mại năm mới', 12, '2024-01-01', '2024-01-15','2023-10-26', '2023-10-26', 1),
('KM22879567', 'Lễ tình nhân','Khuyến mại Valentine', 18, '2024-02-01', '2024-02-14','2023-10-26', '2023-10-26', 1),
('KM21343455', 'Cuối năm từ tốn','Khuyến mại cuối năm', 18, '2022-12-01', '2022-12-31','2023-10-26', '2023-10-26', 1),
('KM10054634', 'Đại lễ Quốc Khánh','Khuyến mại Quốc Khánh', 18, '2024-08-30', '2024-09-2','2023-10-26', '2023-10-26', 1),
('KM54667487', 'Đem trăng rằm','Khuyến mại trung thu', 18, '2024-10-01', '2024-10-10','2023-10-26', '2023-10-26', 1),
('KM99768534', 'Tết thiếu nhi','Khuyến mại 1/6', 18, '2024-05-25', '2024-06-01','2023-10-26', '2023-10-26', 1);
select * from khuyen_mai;

-- Nhân Viên
INSERT INTO nhan_vien (email, gioi_tinh, ma, mat_khau, ngay_sua, ngay_tao, sdt, ten, trang_thai)
VALUES
('lannt@gmail.com', 1, 'NV001', 'password1', '2023-10-26', '2023-08-15', '0909881795', 'Nguyễn Thị Lan', 0),
('khanhnc@gmail.com', 0, 'NV002', 'password2', '2023-10-26', '2023-10-15', '0987353521', 'Nguyễn Công Khánh', 0),
('haodq@gmail.com', 0, 'NV003', 'password3', '2023-10-26', '2023-07-15', '0997881781', 'Dương Quang Hào', 0),
('tuannv@gmail.com', 0, 'NV004', 'password4', '2023-10-26', '2023-05-15', '0925119494', 'Ngô Văn Tuấn', 0),
('hungtv@gmail.com', 0, 'NV005', 'password5', '2023-10-26', '2023-10-10', '0987122822', 'Trần Viết Hưng', 0),
('hocnv6@gmail.com', 0, 'NV006', 'password6', '2023-10-26', '2023-10-15', '0975666989', 'Nguyễn Vũ Học', 0),
('hungnd@gmail.com', 0, 'NV007', 'password7', '2023-10-26', '2023-10-13', '0935083508', 'Nguyễn Duy Hùng', 0),
('khanhld@gmail.com', 0, 'NV008', 'password8', '2023-10-26', '2023-10-15', '0999889889', 'Lê Duy Khanh', 0),
('hangnt@gmail.com', 1, 'NV009', 'password9', '2023-10-26', '2023-03-11', '0973558671', 'Vũ Huy Hoàng', 0),
('thuynt@gmail.com', 1, 'NV010', 'password10', '2023-10-26', '2023-10-15', '0963858759', 'Nguyễn Thị Thùy', 0);
select * from nhan_vien;

INSERT INTO ma_giam_gia (gia_tri_don_hang, ma, ten, mo_ta, muc_giam_gia, muc_giam_toi_da,  ngay_bat_dau, ngay_ket_thuc, ngay_sua, ngay_tao, so_luong, trang_thai)
VALUES
(100000,'MGG22134499', 'Voucher 1', 'Khuyến mại mùa hè', 15, 100000, '2023-07-01', '2023-08-31','2023-06-28', '2023-06-28', 20, 1),
(1100000,'MGG12365632', 'Voucher 2', 'Nhân dịp back-to-school', 15, 100000, '2023-07-01', '2023-09-01', '2023-09-15','2023-08-28', 20, 1),
(2000000,'MGG12352932', 'Voucher 3', 'Nhân dịp black friday', 15, 100000, '2023-11-25', '2023-11-30','2023-10-26', '2023-10-26', 20, 1),
(1000000,'MGG00977532', 'Voucher 4', 'Nhân dịp noenl', 15, 100000, '2023-12-01', '2023-12-25','2023-10-26', '2023-10-26', 20, 1),
(500000,'MGG03453424', 'Voucher 5', 'Nhân dịp năm mới', 15, 100000, '2024-01-01', '2024-01-15','2023-10-26', '2023-10-26', 20, 1),
(900000,'MGG99654534', 'Voucher 6', 'Nhân dịp Valentine', 15, 100000, '2024-02-01', '2024-02-14','2023-10-26', '2023-10-26', 20, 1),
(999999,'MGG12445577', 'Voucher 7', 'Nhân dịp cuối năm', 15, 100000, '2022-12-01', '2022-12-31','2023-10-26', '2023-10-26', 20, 1),
(1500000,'MGG45766779', 'Voucher 8', 'Nhân dịp Quốc Khánh', 15, 100000, '2024-08-30', '2024-09-2','2023-10-26', '2023-10-26', 20, 1),
(3000000,'MGG78434390', 'Voucher 9', 'Khuyến mại trung thu', 15, 100000, '2024-10-01', '2024-10-10','2023-10-26', '2023-10-26', 20, 1),
(3000000,'MGG78434391', 'Voucher 10', 'Nhân dịp 1/6', 15, 100000, '2024-10-01', '2024-10-10','2023-10-26', '2023-10-26', 20, 1);
select * from ma_giam_gia;